# Occupation

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from data.csv

In [2]:
df=pd.read_csv('data.csv')

### Step 3. List first rows

In [4]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Last Ten rows

In [5]:
last_ten = df.tail(10)
last_ten

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Step 5. Assign it to a variable called users.

In [6]:
users = df
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Step 6. Discover what is the mean age per occupation

### Step 7. For each occupation, calculate the minimum and maximum ages

### Step 8. For each combination of occupation and gender, calculate the mean age

### Step 9.  For each occupation present the number of women and men

### Step 10. Displays the distribution of ages using histogram